<script setup lang="ts">
import { LayoutContent, Divider } from 'ant-design-vue';
import CardWork from './CardWork.vue';

const experience = [
    {
        date: '2021 -  2022',
        company: 'Codica | Преподователь программирования',
        description:
            'Проводила занятия по обучению основам программирования для детей школьно-дошкольного возраста (6—12 лет); \
        Разрабатывала и адаптировала учебные программы для дисциплин: программирование на Python, \
        Scratch, основы гейм-дизайна, создание игр в среде Minecraft на языке Python, обучение \
        компьютерной грамотности; Осуществляла индивидуализированный подход, адаптируя материал под \
        уровень подготовки каждого ученика группы (5—7 учеников одновременно); Постоянно совершенствовала \
        структуру уроков, создавала новые интерактивные задания и игры, способствующие лучшему усвоению \
        материала; Организовывала тематические мастер-классы и мероприятия, \
        направленные на повышение интереса учащихся к сфере IT-технологий; Активно взаимодействовала\
        с родителями обучающихся, предоставляя обратную связь и рекомендации по развитию ребенка.',
        descriptions: [
            'Проводила занятия по обучению основам программирования для детей школьно-дошкольного \
                возраста (6—12 лет)',
            'Разрабатывала и адаптировала учебные программы для дисциплин: программирование на Python, \
                Scratch, основы гейм-дизайна, создание игр в среде Minecraft на языке Python, обучение \
                компьютерной грамотности',
            'Осуществляла индивидуализированный подход, адаптируя материал под уровень подготовки \
                каждого ученика группы (5—7 учеников одновременно)',
            'Постоянно совершенствовала структуру уроков, создавала новые интерактивные задания и \
                игры, способствующие лучшему усвоению материала',
            'Организовывала тематические мастер-классы и мероприятия, направленные на повышение \
                интереса учащихся к сфере IT-технологий',
            'Активно взаимодействовала с родителями обучающихся, предоставляя обратную связь и \
                рекомендации по развитию ребенка',
        ],
    },
    {
        date: '2021 -  2022',
        company: 'Самарский государственный колледж | Преподователь',
        description:
            'Преподавала курсы «Компьютерная грамотность», формируя фундаментальные знания учащихся \
            по работе с современными технологиями и инструментами ИТ-отрасли; Создавала образовательные \
            программы и методические пособия по дисциплинам, включая курс «Основы дошкольного образования», \
            используя современные методики; Руководила учебной группой, осуществляла контроль успеваемости, \
            организовывала индивидуальные консультации, мотивируя студентов развивать навыки самообразования \
            и инициативности; Разработала рабочие образовательные программы учебных курсов, \
            соответствующие требованиям ФГОС; Регулярно обновляла содержание курсов и внедрил \
            инновационные методы преподавания, ориентированные на формирование практических компетенций \
            в области цифровых технологий; Применяла технологии дистанционного обучения и \
            электронного сопровождения образовательного процесса, обеспечивая доступ к материалам и \
            поддержку студентов онлайн; Участвовала в создании учебно-методического комплекса дисциплин, \
            активно внедряя цифровые инструменты для повышения эффективности образовательной среды.',
        descriptions: [
            'Преподавала курсы «Компьютерная грамотность», формируя фундаментальные знания учащихся \
                по работе с современными технологиями и инструментами ИТ-отрасли',
            'Создавала образовательные программы и методические пособия по дисциплинам, включая курс \
                «Основы дошкольного образования», используя современные методики',
            'Руководила учебной группой, осуществляла контроль успеваемости, организовывала \
                индивидуальные консультации, мотивируя студентов развивать навыки самообразования \
                и инициативности',
            'Разработала рабочие образовательные программы учебных курсов, соответствующие \
                требованиям ФГОС;',
            'Регулярно обновляла содержание курсов и внедряла инновационные методы преподавания, \
                ориентированные на формирование практических компетенций в области цифровых технологий',
            'Применяла технологии дистанционного обучения и электронного сопровождения \
                образовательного процесса, обеспечивая доступ к материалам и поддержку студентов онлайн',
            'Участвовала в создании учебно-методического комплекса дисциплин, активно внедряя \
                цифровые инструменты для повышения эффективности образовательной среды',
        ],
    },
    {
        date: '2022 -  2024',
        company:
            'Школа робототехники и программирования Инновация | Преподователь',
        description:
            'Обучение основам алгоритмов, структуры данных и объектно-ориентированного программирования \
            на языках Python, Scratch, Scratch Junior, LEGO WeDo, LEGO WeDo2.0, LEGO Mindstorms EV3 и Tetra Scratch; \
            Разрабатывала и адаптировала учебные материалы для повышения эффективности образовательного процесса, \
            создание интерактивных заданий и проектов, стимулирующих интерес учащихся к технологиям и инженерному \
            мышлению; Организация индивидуальных подходов к обучению каждого ребенка внутри группы (до 4-х \
            учеников одновременно, но каждый в своем направлении), учитывая различия в уровнях подготовки и \
            скорости усвоения материала. Применение методик развития soft skills (коммуникационные способности, \
            умение решать проблемы и творческое мышление);  Активно участвовала в процессе оценки \
            результатов учебной деятельности, предоставление обратной связи родителям обучающихся и \
            рекомендации по дальнейшему развитию компетенций ребёнка.',
        descriptions: [
            'Обучение основам алгоритмов, структуры данных и объектно-ориентированного программирования \
                на языках Python, Scratch, Scratch Junior, LEGO WeDo, LEGO WeDo2.0, LEGO Mindstorms EV3 и \
                Tetra Scratch',
            'Разрабатывала и адаптировала учебные материалы для повышения эффективности образовательного \
                процесса, создание интерактивных заданий и проектов, стимулирующих интерес учащихся к \
                технологиям и инженерному мышлению',
            'Организация индивидуальных подходов к обучению каждого ребенка внутри группы (до 4-х \
                учеников одновременно, но каждый в своем направлении), учитывая различия в уровнях \
                подготовки и скорости усвоения материала',
            'Применение методик развития soft skills (коммуникационные способности, умение решать \
                проблемы и творческое мышление)',
            'Активно участвовала в процессе оценки результатов учебной деятельности, предоставление \
                обратной связи родителям обучающихся и рекомендации по дальнейшему развитию компетенций \
                ребёнка',
        ],
    },
    {
        date: '2024 -  2025',
        company:
            'Индивидуальное предпринимательство / частная практика / фриланс | Frontend-разработчик',
        description:
            ' Проектная разработка независимых частей приложения: занималась проектированием и \
            разработкой отдельных модулей веб-приложений, ориентированных на конкретные требования \
            заказчиков. Реализовывала уникальные интерфейсы и стили приложений, обеспечивая высокий \
            уровень кастомизации и адаптивности под нужды бизнеса клиента; Работа в распределенной \
            команде: эффективно взаимодействовала в удаленной команде, состоящей из трех \
            фронтенд-разработчиков, бэкендера, тестировщика, аналитика и менеджера проекта. \
            Координировала свою работу с коллегами разных направлений, поддерживая высокую \
            продуктивность и качество разработки; Участие в создании библиотеки компонентов: \
            активно участвовала в разработке собственной библиотеки UI-компонентов, применяя \
            полученные компоненты в реальных коммерческих проектах. Это позволило существенно \
            сократить время на разработку новых решений и повысить качество конечного продукта. \
            Исправление и выявление багов : регулярно проводил ревизии и оптимизацию существующего \
            кода, выявлял и устранял баги различного уровня сложности. Обеспечивала стабильность и \
            надежность разрабатываемых продуктов, снижал риски возникновения ошибок и повышал общую \
            производительность системы; оптимизация программного кода ;Постоянно работала над улучшением \
            производительности и оптимизации скорости загрузки страниц и компонентов. Применяла лучшие \
            практики кодирования, минимизировала использование ресурсов браузера и сервера, достигая \
            оптимального баланса между производительностью и функциональностью. Используемые технологии: \
            JavaScript, TypeScript, Git, HTML, CSS, Vue',
        descriptions: [
            'Проектная разработка независимых частей приложения: занималась проектированием и \
                разработкой отдельных модулей веб-приложений, ориентированных на конкретные требования \
                заказчиков',
            'Реализовывала уникальные интерфейсы и стили приложений, обеспечивая высокий уровень \
                кастомизации и адаптивности под нужды бизнеса клиента',
            'Работа в распределенной команде: эффективно взаимодействовала в удаленной команде, состоящей \
                из трех фронтенд-разработчиков, бэкендера, тестировщика, аналитика и менеджера проекта',
            'Координировала свою работу с коллегами разных направлений, поддерживая высокую \
                продуктивность и качество разработки',
            'Участие в создании библиотеки компонентов: активно участвовала в разработке собственной \
                библиотеки UI-компонентов, применяя полученные компоненты в реальных коммерческих проектах. \
                Это позволило существенно сократить время на разработку новых решений и повысить \
                качество конечного продукта',
            'Исправление и выявление багов : регулярно проводила ревизии и оптимизацию существующего \
                кода, выявляла и устраняла баги различного уровня сложности',
            ' Обеспечивала стабильность и надежность разрабатываемых продуктов, снижал риски возникновения \
                ошибок и повышал общую производительность системыю Оптимизировала программный код',
            'Постоянно работала над улучшением производительности и оптимизации скорости загрузки \
                страниц и компонентов. Применяла лучшие практики кодирования, минимизировала использование \
                ресурсов браузера и сервера, достигая оптимального баланса между производительностью и \
                функциональностью',
            'Используемые технологии: JavaScript, TypeScript, Git, HTML, CSS, Vue',
        ],
    },
];
</script>

<template>
    <LayoutContent>
        <Divider class="divider-work" orientation="left" type="horizontal">
            <i>Опыт работы</i>
        </Divider>

        <CardWork
            v-for="value in experience"
            :date="value.date"
            :company="value.company"
            :descriptions="value.descriptions"
        ></CardWork>
    </LayoutContent>
</template>

<style scoped>
.ant-layout .ant-layout-content {
    padding: 16px;
    padding-top: 0;
}

.ant-layout .ant-layout-content > * {
    margin-bottom: 16px;
}

.divider-work {
    border-color: rgb(91, 91, 211);
    font-size: 20px;
    margin: 0px 0px 20px 0px;
}

.header-work {
    display: flex;
    align-items: center;
}

.text-work {
    font-size: 20px;
    display: flex;
    align-items: center;
    margin-left: 115px;
}

.img-success {
    position: absolute;
    height: 100px;
    opacity: 0.09;
    z-index: 999;
    margin-top: 30px;
}
</style>
